In [104]:
import pandas as pd
df = pd.read_csv("titanic/train.csv")

In [105]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

pclass: A proxy for socio-economic status (SES)
1st = Upper
2nd = Middle
3rd = Lower

age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

sibsp: The dataset defines family relations in this way...
Sibling = brother, sister, stepbrother, stepsister
Spouse = husband, wife (mistresses and fianc√©s were ignored)

parch: The dataset defines family relations in this way...
Parent = mother, father
Child = daughter, son, stepdaughter, stepson
Some children travelled only with a nanny, therefore parch=0 for them.

## Remove unwanted columns

In [106]:
df = df.drop(['PassengerId', 'Name', 'Ticket', 'Fare'], axis=1) #axis is required

In [107]:
df
from numpy import nan

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Cabin     204 non-null    object
 7   Embarked  889 non-null    object
dtypes: float64(1), int64(4), object(3)
memory usage: 55.8+ KB

In [109]:
df.drop(['Cabin'], axis =1, inplace=True)

In [110]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

### Filling missing values in age by average age of males and females

In [111]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [113]:
df[df['Embarked'].isna()].index

Int64Index([61, 829], dtype='int64')

In [114]:
df.drop([61, 829], axis =0, inplace=True)

In [136]:
df.reset_index(drop=True, inplace=True)

In [137]:
mean_all = df['Age'].mean()
mean_all

29.64209269662921

In [138]:
mean_male = df[df['Sex'] == 'male']['Age'].mean()
mean_male

30.72664459161148

In [139]:
mean_female = df[df['Sex'] == 'female']['Age'].mean()
mean_female

27.745173745173744

In [140]:
men_nan_index_list = df[(df['Age'].isna()) & (df['Sex'] == 'male')]['Age'].index

In [142]:
men_nan_index_list

Int64Index([  5,  17,  26,  29,  36,  42,  45,  46,  48,  55,
            ...
            824, 825, 827, 830, 835, 837, 844, 857, 866, 876],
           dtype='int64', length=124)

In [145]:
for i in men_nan_index_list:
    df.iloc[i, 3:4] = mean_male

In [146]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  889 non-null    int64
 1   Pclass    889 non-null    int64
 2   Sex       889 non-null    object
 3   Age       836 non-null    float64
 4   SibSp     889 non-null    int64
 5   Parch     889 non-null    int64
 6   Embarked  889 non-null    object
dtypes: float64(1), int64(4), object(2)
memory usage: 48.7+ KB

In [150]:
women_nan_index_list = df[(df['Age'].isna()) & (df['Sex'] == 'female')]['Age'].index
for i in women_nan_index_list:
    df.iloc[i, 3:4] = mean_female

In [151]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  889 non-null    int64
 1   Pclass    889 non-null    int64
 2   Sex       889 non-null    object
 3   Age       889 non-null    float64
 4   SibSp     889 non-null    int64
 5   Parch     889 non-null    int64
 6   Embarked  889 non-null    object
dtypes: float64(1), int64(4), object(2)
memory usage: 48.7+ KB

In [153]:
!pip3 freeze > requirements.txt

In [152]:
!ls

EDA_basics.ipynb LICENSE          README.md        titanic